import React, { Component } from "react";

class Shar7 extends Component {
  state = {
    hokm: ""
  };
  componentDidMount() {
    const hokm = this.props.match.params.id;
    this.setState({ hokm });
  }
  render() {
    const { hokm } = this.state;
    return (
      <React.Fragment>
        {hokm === "Ekhfaa" && (
          <div className="pt-5 my-5">
            <div className="container mainComponent">
              <h1>حكم {hokm}</h1>
              <p>
                معنى الإخفاء يُعرّف الإخفاء لغة بأنّه الستر، ويقال أخفيت الكتاب:
                أي سترته عن العيون، واصطلاحًا: هو أحد أحكام التجويد ويتمثّل في
                النطق بصفة بين الإظهار والإدغام، أي أنّه خالٍ من التشديد، ولكن
                مع وجود غنة،[١] وعليه فإنّ الإخفاء لا يكون إلّا من خلال تحقق
                الأمور الآتية:[٢] يكون الإخفاء الحقيقي بالنطق في النون الساكنة
                أو التنوين، أمّا الإخفاء الشفوي فيكون بالنطق في الميم الساكنة،
                مع مراعاة توسّط النطق بين الإظهار والإدغام. يجب ألّا يتم التشديد
                على الحرف المخفي، لأن الإخفاء على العكس من الإدغام. يتم تطبيق
                الغنة من جنس الحرف الواقع بعده، بحيث يلاحظ ما بعد الغنة من
                نفسها. حروف الإخفاء يبلغ عدد حروف الإخفاء الحقيقي 15 حرفاً، فإذا
                جاء حرف من هذه الحروف بعد النون الساكنة، أو بعد التنوين في كلمة،
                أو في كلمتين، وجب إخفاؤهما، وقد تم جمع حروف الإخفاء في البيت
                الآتي:[٢] صف ذا ثنا كم جاد شخص قد سما دم طيبا زد في تقى ضع ظالما
                وقال بعضهم: ضحكت زينب فأبدت ثنايا تركتني سكران دون شراب طوقتني
                ظلما قلايد ذل جرعتي جفونها كأس صاب كيفية النطق بالإخفاء يقول ابن
                الجزريّ في النطق بالإخفاء أثناء التلاوة: لا بدّ وأن يترك القارئ
                فرجة صغيرة في الشفتين عند النطق بالإخفاء، للسماح للهواء بالمرور،
                إذ إنّ إطباق الشفتين يتسبّب بعدم ظهور الإخفاء، كما أنّ إخفاء
                الميم لا يعني إعدام وجودها مطلقاً، بل يعني إضعافها، وإخفاء جزء
                يسير منها في الجملة، ويكون هذا بتقليل الاعتماد على مخرجها، وهو
                الشفتين؛ وذلك لأنّ قوة النطق بالحرف يعتمد بشكل كبير على مخرجه،
                وإخفاء جزء منه يتطلّب تجاهل المخرج شيئاً يسيراً.[٣] سبب تسميته
                بالإخفاء يكمن سبب الإخفاء في عدم اقتراب مخرج النون الساكنة
                والتنوين من مخارج حروف الإخفاء، وعدم ابتعاد مخرجهما عن مخارج
                حروف الإخفاء، ولهذا السبب فإنّ حكم الإخفاء هو عدم الاقتراب في
                المخارج كالإدغام، وعدم الابتعاد الموجب كالإظهار، وبناءً على هذا
                أُعطي الإخفاء حكماً متوسطاً بين الإظهار والإدغام، وفي هذه الحالة
                فإنّ اللسان لا يعمل؛ لأنّ النون الساكنة والتنوين يخرجان من
                الخيشوم عند النطق بحكم الإخفاء. إقرأ المزيد على موضوع.كوم:
                https://mawdoo3.com/%D9%85%D8%A7_%D9%87%D9%88_%D8%A7%D9%84%D8%A5%D8%AE%D9%81%D8%A7%D8%A1
              </p>
            </div>
          </div>
        )}
      </React.Fragment>
    );
  }
}

export default Shar7;
